test/ExactOnline.Client.Sdk.UnitTests/Json/Response_Json_Array_SalesInvoice_WithLinkedEntities.txt

{
    "d": {
        "results": [
            {
                "__metadata": {
                    "uri": "https://start.exactonline.nl/api/v1/499156/salesinvoice/SalesInvoices(guid'c00ee12c-2b39-4e84-b332-54a3c722e5dd')",
                    "type": "Exact.Web.Api.Models.SalesInvoice"
                },
                "AmountFC": 9075,
                "AmountDC": 9075,
                "Created": "/Date(1382667906263)/",
                "Creator": "99d87844-e4ef-4ac5-968c-fb863eaced16",
                "CreatorFullName": null,
                "Currency": "EUR",
                "Description": "Levering diverse artikelen",
                "Division": 499156,
                "Document": null,
                "DocumentNumber": null,
                "DocumentSubject": null,
                "DueDate": "/Date(1351209600000)/",
                "InvoiceDate": "/Date(1351209600000)/",
                "InvoiceID": "c00ee12c-2b39-4e84-b332-54a3c722e5dd",
                "InvoiceTo": "3734121e-1544-4b77-9ae2-7203e9bd6046",
                "InvoiceToContactPerson": "e893e6e6-6eeb-4420-a5b2-378618ba9f27",
                "InvoiceToContactPersonFullName": "Karin Jansen",
                "InvoiceToName": "Test ABC Producten & Diensten B.V.",
                "InvoiceNumber": null,
                "Journal": "50",
                "JournalDescription": "Verkoopboek",
                "Modified": "/Date(1382667906263)/",
                "Modifier": "99d87844-e4ef-4ac5-968c-fb863eaced16",
                "ModifierFullName": null,
                "OrderDate": "/Date(1351209600000)/",
                "OrderedBy": "3734121e-1544-4b77-9ae2-7203e9bd6046",
                "OrderedByContactPerson": "e893e6e6-6eeb-4420-a5b2-378618ba9f27",
                "OrderedByContactPersonFullName": "Karin Jansen",
                "OrderedByName": "Test ABC Producten & Diensten B.V.",
                "OrderNumber": 1,
                "PaymentCondition": "21",
                "PaymentConditionDescription": "21 dagen",
                "Remarks": null,
                "Salesperson": null,
                "SalespersonFullName": null,
                "Status": 20,
                "StatusDescription": "Open",
                "Type": 8020,
                "TypeDescription": "Normal",
                "VATAmountFC": 1575,
                "VATAmountDC": 1575,
                "YourRef": null,
                "SalesInvoiceLines": {
                    "results": [
                        {
                            "__metadata": {
                                "uri": "https://start.exactonline.nl/api/v1/499156/salesinvoice/SalesInvoiceLines(guid'ea799352-5da3-4b16-acc0-20dcfe4d02fc')",
                                "type": "Exact.Web.Api.Models.SalesInvoiceLine"
                            },
                            "AmountFC": 7500,
                            "AmountDC": 7500,
                            "CostCenter": null,
                            "CostCenterDescription": null,
                            "CostUnit": null,
                            "CostUnitDescription": null,
                            "Description": "Standaard artikel",
                            "Discount": 0,
                            "Division": 499156,
                            "Employee": null,
                            "EmployeeFullName": null,
                            "EndTime": null,
                            "GLAccount": "4eae751d-fc91-4c99-b1e6-646fe3401a12",
                            "GLAccountDescription": "This is a Test",
                            "ID": "ea799352-5da3-4b16-acc0-20dcfe4d02fc",
                            "InvoiceID": "c00ee12c-2b39-4e84-b332-54a3c722e5dd",
                            "Item": "4f68481a-7a2c-4fbc-a3a0-0c494df3fa0d",
                            "ItemDescription": "Standaard artikel",
                            "LineNumber": 1,
                            "NetPrice": 25,
                            "Notes": null,
                            "Pricelist": null,
                            "PricelistDescription": null,
                            "Project": null,
                            "ProjectDescription": null,
                            "Quantity": 300,
                            "StartTime": null,
                            "Subscription": null,
                            "SubscriptionDescription": null,
                            "UnitCode": "pc",
                            "UnitDescription": "Piece",
                            "UnitPrice": 25,
                            "VATAmountFC": 1575,
                            "VATAmountDC": 1575,
                            "VATCode": "02 ",
                            "VATCodeDescription": "Af te dragen BTW hoog tarief, exclusief",
                            "VATPercentage": 0.21
                        }
                    ]
                }
            },
            {
                "__metadata": {
                    "uri": "https://start.exactonline.nl/api/v1/499156/salesinvoice/SalesInvoices(guid'b1f67a3c-c377-41ca-809d-763d3e1e83c2')",
                    "type": "Exact.Web.Api.Models.SalesInvoice"
                },
                "AmountFC": 6352.5,
                "AmountDC": 6352.5,
                "Created": "/Date(1382667906407)/",
                "Creator": "99d87844-e4ef-4ac5-968c-fb863eaced16",
                "CreatorFullName": null,
                "Currency": "EUR",
                "Description": "Ontwikkelen nieuw concept",
                "Division": 499156,
                "Document": null,
                "DocumentNumber": null,
                "DocumentSubject": null,
                "DueDate": "/Date(1351209600000)/",
                "InvoiceDate": "/Date(1351209600000)/",
                "InvoiceID": "b1f67a3c-c377-41ca-809d-763d3e1e83c2",
                "InvoiceTo": "3734121e-1544-4b77-9ae2-7203e9bd6046",
                "InvoiceToContactPerson": "48d2d6d0-1fc8-4eb9-be31-87ca27931fca",
                "InvoiceToContactPersonFullName": "Piet Mulder",
                "InvoiceToName": "Test ABC Producten & Diensten B.V.",
                "InvoiceNumber": null,
                "Journal": "50",
                "JournalDescription": "Verkoopboek",
                "Modified": "/Date(1382667906407)/",
                "Modifier": "99d87844-e4ef-4ac5-968c-fb863eaced16",
                "ModifierFullName": null,
                "OrderDate": "/Date(1351209600000)/",
                "OrderedBy": "3734121e-1544-4b77-9ae2-7203e9bd6046",
                "OrderedByContactPerson": "e893e6e6-6eeb-4420-a5b2-378618ba9f27",
                "OrderedByContactPersonFullName": "Karin Jansen",
                "OrderedByName": "Test ABC Producten & Diensten B.V.",
                "OrderNumber": 2,
                "PaymentCondition": "21",
                "PaymentConditionDescription": "21 dagen",
                "Remarks": null,
                "Salesperson": null,
                "SalespersonFullName": null,
                "Status": 20,
                "StatusDescription": "Open",
                "Type": 8020,
                "TypeDescription": "Normal",
                "VATAmountFC": 1102.5,
                "VATAmountDC": 1102.5,
                "YourRef": null,
                "SalesInvoiceLines": {
                    "results": [
                        {
                            "__metadata": {
                                "uri": "https://start.exactonline.nl/api/v1/499156/salesinvoice/SalesInvoiceLines(guid'983eb99f-3ef5-4c58-80fb-5302038e94be')",
                                "type": "Exact.Web.Api.Models.SalesInvoiceLine"
                            },
                            "AmountFC": 5250,
                            "AmountDC": 5250,
                            "CostCenter": null,
                            "CostCenterDescription": null,
                            "CostUnit": null,
                            "CostUnitDescription": null,
                            "Description": "Consultancy per uur",
                            "Discount": 0,
                            "Division": 499156,
                            "Employee": null,
                            "EmployeeFullName": null,
                            "EndTime": null,
                            "GLAccount": "4eae751d-fc91-4c99-b1e6-646fe3401a12",
                            "GLAccountDescription": "This is a Test",
                            "ID": "983eb99f-3ef5-4c58-80fb-5302038e94be",
                            "InvoiceID": "b1f67a3c-c377-41ca-809d-763d3e1e83c2",
                            "Item": "3970056b-1efd-4b67-a0f8-9684411b6e42",
                            "ItemDescription": "Consultancy per uur",
                            "LineNumber": 1,
                            "NetPrice": 75,
                            "Notes": null,
                            "Pricelist": null,
                            "PricelistDescription": null,
                            "Project": null,
                            "ProjectDescription": null,
                            "Quantity": 70,
                            "StartTime": null,
                            "Subscription": null,
                            "SubscriptionDescription": null,
                            "UnitCode": "hour",
                            "UnitDescription": "Hour",
                            "UnitPrice": 75,
                            "VATAmountFC": 1102.5,
                            "VATAmountDC": 1102.5,
                            "VATCode": "02 ",
                            "VATCodeDescription": "Af te dragen BTW hoog tarief, exclusief",
                            "VATPercentage": 0.21
                        }
                    ]
                }
            }
        ]
    }
}